import { SelectData } from "~~/models/utilities/SelectData";

export enum Color {
  سفید = "سفید",
  مشکی = "مشکی",
  خاکستری = "خاکستری",
  نقره_ای = "نقره_ای",
  سفید_صدفی = "سفید_صدفی",
  نوک_مدادی = "نوک_مدادی",
  آبی = "آبی",
  قهوه_ای = "قهوه_ای",
  قرمز = "قرمز",
  سرمه_ای = "سرمه_ای",
  سریی = "سریی",
  تیتانیوم = "تیتانیوم",
  یشمی = "یشمی",
  زرد = "زرد",
  آلبالویی = "آلبالویی",
  کربن_بلک = "کربن_بلک",
  بادمجانی = "بادمجانی",
  مسی = "مسی",
  سبز = "سبز",
  دلفینی = "دلفینی",
  ذغالی = "ذغالی",
  نقرآبی = "نقرآبی",
  کرم = "کرم",
  زیتونی = "زیتونی",
  نارنجی = "نارنجی",
  طوسی = "طوسی",
  اطلسی = "اطلسی",
  طلائی = "طلائی",
  زرشکی = "زرشکی",
  گیلاسی = "گیلاسی",
  عنابی = "عنابی",
  بنفش = "بنفش",
  خاکی = "خاکی",
  پوست_پیازی = "پوست_پیازی",
  موکا = "موکا",
  برنز = "برنز",
}

export const GenerateColorSelectData = (): SelectData[] => {
  let colors = [] as SelectData[];

  Object.values(Color).map(f=>{
    colors.push({
      //@ts-ignore
        label: f.replaceAll("_"," "),
      //@ts-ignore
        value: f,
      });
  })
  return colors;
};
